# 10 Nov 2020 19:43
MD is short for Magnetic Dance.
This folder contains classes and other code for work with wearable motion sensors used in the Magnetic Dance project.  It's aims are to enable telematic dance, by transmitting data captured from these sensors over the internet to remote locations and resynthesizing the performance sounds locally based on data received from the sensors worn by the dancers. 
*** How to map:
 #+begin_src sclang
 { SinOsc.ar(\freq.kr(400), 0, 0.05).stereo } +> \test;
 { LFDNoise1.kr(5).range(200, 2000) }.map(\test, \freq);
 #+end_src

 #+RESULTS:
 : { SinOsc.ar(\freq.kr(400), 0, 0.05).stereo } +> \test;
 : { LFDNoise1.kr(5).range(200, 2000) }.map(\test, \freq);

